syllabus.org
#+TITLE:DSC 101 Fall 2021 Syllabus
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: Data Science Methods and Tools
#+options: toc:nil
* General Course Information

  * Meeting Times: Tuesday & Thursday, 13:00-14:15 hrs
  * Meeting place: Derby 209 (CS research lab)
  * Professor: Marcus Birkenkrahe
  * Office: Derby 210
  * Phone: (501) 422-4725
  * Office hours: Mon/Wed/Fri 10:00-10:30 AM; Tue/Thu 4-4:30 PM
  * Text: /The Art of R Programming - A Tour of Statistical Software
    Design/, by Norman Matloff, NoStarch Press (2011).

** Objectives

   Data science is about how to get data to work for us, to give us its
   hidden treasures. Data science has been called "the sexiest job of
   the 21st century". Even if you don't want to become a professional
   data scientist, it’s helpful to master the basic concepts if you
   want to succeed in today's highly data-driven business
   environment. This courses focuses on: data science basics,
   visualization and productivity tools. The course is for everyone who
   is interested in becoming more data literate and growing their skill
   stack. Besides short, synchronous lectures and practice sessions,
   you can learn from weekly quizzes, exercises and a plethora of
   other, custom-built online materials.

** Student Learning Outcomes

   Students who complete DSC101 are able to:

   * Organize data visually in a way that is clear and informative
   * Find and use data sets from the real world
   * Easily and quickly format data into graphs
   * Understand and present statistical information
   * Understand how modern productivity tools can help you
   * Complete an exploratory data analysis project in small steps

** Course requirements

   No prior knowledge required. Both the necessary programming and
   statistical concepts are introduced in the course using examples and
   simple mini-projects. Previous programming experience is useful but
   not mission-critical. Curiosity is essential. You will gain data
   literacy skills by taking this course.

** Grading system

   |-----------+----------------------+--------+--------|
   | When      | Description          | Impact | Graded |
   |-----------+----------------------+--------+--------|
   | Weekly    | DataCamp assignment  |    15% | No     |
   | Weekly    | Weekly tests         |    15% | No     |
   | Last week | Project presentation |    30% | Yes    |
   | TBD       | Final exam           |    40% | Yes    |
   |-----------+----------------------+--------+--------|

*** Grading table

    This table is used to convert completion rates into letter
    grades. For the midterm results, letter grades still carry signs,
    while for the term results, only straight letters are given (by
    rounding up).

    |--------+-----------------+---------------|
    |    *%* | *Midterm Grade* | *Final Grade* |
    |--------+-----------------+---------------|
    | 100-98 | A+              |               |
    |  97-96 | A               | A             |
    |  95-90 | A-              |               |
    |--------+-----------------+---------------|
    |  89-86 | B+              |               |
    |  85-80 | B               | B             |
    |  79-76 | B-              |               |
    |--------+-----------------+---------------|
    |  75-70 | C+              |               |
    |  69-66 | C               | C             |
    |  65-60 | C-              |               |
    |--------+-----------------+---------------|
    |  59-56 | D+              |               |
    |  55-50 | D               | D             |
    |--------+-----------------+---------------|
    |   49-0 | F               | F             |
    |--------+-----------------+---------------|

*** DataCamp assignments (15%)

    Chapters of several DataCamp courses will be assigned to you. To
    complete a chapter takes 20-30 minutes per week. If you complete
    these courses, you get data science certificates that you can add
    to your resume (or to career management portals like LinkedIn -
    see [[https://www.linkedin.com/in/birkenkrahe][my LinkedIn profile]] for an example), or frame and put them on
    your wall. Your DataCamp assignment completion rate will enter the
    final grade cumulatively.

*** Tests (15%)

    There will be 30 short multiple choice tests of 5 questions per
    week. Your grade will be computed from your average completion rate
    over all tests.

*** Project presentation (30%)

    In the last week, you present the results of an agile explorative
    data analysis (EDA) team project. We use the agile Scrum
    methodology throughout the term, which means that you will present
    prototype results during four sprint reviews (about once every four
    weeks), the last of which is the final product or project
    presentation.

    Note that only the final presentation will be graded according to
    the grading table. Detailed grading criteria for the presentation
    will be given in class in the form of a rubric.

*** Exam (40%)

    The final exam will consist of a subset of the weekly test
    questions, possibly with some slight variations to make it more
    interesting. The basic idea is that you can use the tests to
    prepare yourself for the exam. The completion rate of the final
    exam will enter the final grade according to the grading table.

** Grading examples
*** Example - Midterm grade

    At midterms, student X has achieved the following results:

    | *Grade part*         | *Weight* | *Result* |
    |----------------------+----------+----------|
    | Tests                |      15% | 72%      |
    | DataCamp assignment  |      15% | 100%     |

    # Student X's midterm result is computed as follows:
    # #+begin_src R :session :results output
    #   ## midterm weights (only tests and datacamp assignments)
    #   weight_m <- c("tests"=0.5,
    #                 "datacamp"=0.5)
    #   ## results vector
    #   result_m <- c("tests"=72,
    #                 "datacamp"=100)
    #   ## midterm grade
    #   grade_m <-
    # 	weight_m["tests"] * result_m["tests"] +
    # 	weight_m["datacamp"] * result_m["datacamp"]
    #   names(grade_m) <- NULL
    #   grade_m
    # #+end_src

    Student X's midterm result is a "B+" (~86%~).

*** Example - Final grade

    After the finals, student X has achieved the following results:

    | *Grade part*         | *Weight* | *Result* |
    |----------------------+----------+----------|
    | Tests                |      15% |      72% |
    | DataCamp assignment  |      15% |     100% |
    | Project presentation |      30% |      95% |
    | Final exam           |      40% |      90% |

    # Student X's midterm result is computed as follows:
    # #+begin_src R :session :results output
    #   ## full term weight vector according to grading table
    #   weight <- c("exam"= 0.4,
    #               "project"=0.3,
    #               "tests"=0.15,
    #               "datacamp"=0.15)
    #   ## results vector
    #   result <- c("exam"=90,
    #               "project"=95,
    #               "tests"=72,
    #               "datacamp"=100)
    #   ## midterm grade
    #   grade <-
    # 	weight["exam"] * result["exam"] +
    # 	weight["project"] * result["project"] +
    # 	weight["tests"] * result["tests"] +
    # 	weight["datacamp"] * result["datacamp"]
    #   names(grade) <- NULL
    #   grade
    # #+end_src

    Student X's midterm result is an "A" (~90.3%~).

* Standard Policies
