syllabus.md


# General Course Information

-   Meeting Times: Tuesday & Thursday, 13:00-14:15 hrs
-   Meeting place: Derby 209 (CS research lab)
-   Professor: Marcus Birkenkrahe
-   Office: Derby 210
-   Phone: (501) 422-4725
-   Office hours: Mon/Wed/Fri 10:00-10:30 AM; Tue/Thu 4-4:30 PM
-   Text: *The Art of R Programming - A Tour of Statistical Software
    Design*, by Norman Matloff, NoStarch Press (2011).


## Objectives

Data science is about how to get data to work for us, to give us its
hidden treasures. Data science has been called "the sexiest job of
the 21st century". Even if you don't want to become a professional
data scientist, it’s helpful to master the basic concepts if you
want to succeed in today's highly data-driven business
environment. This courses focuses on: data science basics,
visualization and productivity tools. The course is for everyone who
is interested in becoming more data literate and growing their skill
stack. Besides short, synchronous lectures and practice sessions,
you can learn from weekly quizzes, exercises and a plethora of
other, custom-built online materials.


## Student Learning Outcomes

Students who complete DSC101 are able to:

-   Organize data visually in a way that is clear and informative
-   Find and use data sets from the real world
-   Easily and quickly format data into graphs
-   Understand and present statistical information
-   Understand how modern productivity tools can help you
-   Complete an exploratory data analysis project in small steps


## Course requirements

No prior knowledge required. Both the necessary programming and
statistical concepts are introduced in the course using examples and
simple mini-projects. Previous programming experience is useful but
not mission-critical. Curiosity is essential. You will gain data
literacy skills by taking this course.


## Grading system

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">When</th>
<th scope="col" class="org-left">Description</th>
<th scope="col" class="org-right">Impact</th>
<th scope="col" class="org-left">Graded</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Weekly</td>
<td class="org-left">DataCamp assignment</td>
<td class="org-right">15%</td>
<td class="org-left">No</td>
</tr>


<tr>
<td class="org-left">Weekly</td>
<td class="org-left">Weekly tests</td>
<td class="org-right">15%</td>
<td class="org-left">No</td>
</tr>


<tr>
<td class="org-left">Last week</td>
<td class="org-left">Project presentation</td>
<td class="org-right">30%</td>
<td class="org-left">Yes</td>
</tr>


<tr>
<td class="org-left">TBD</td>
<td class="org-left">Final exam</td>
<td class="org-right">40%</td>
<td class="org-left">Yes</td>
</tr>
</tbody>
</table>


### Grading table

This table is used to convert completion rates into letter
grades. For the midterm results, letter grades still carry signs,
while for the term results, only straight letters are given (by
rounding up).

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">**%**</th>
<th scope="col" class="org-left">**Midterm Grade**</th>
<th scope="col" class="org-left">**Final Grade**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">100-98</td>
<td class="org-left">A+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">97-96</td>
<td class="org-left">A</td>
<td class="org-left">A</td>
</tr>


<tr>
<td class="org-right">95-90</td>
<td class="org-left">A-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">89-86</td>
<td class="org-left">B+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">85-80</td>
<td class="org-left">B</td>
<td class="org-left">B</td>
</tr>


<tr>
<td class="org-right">79-76</td>
<td class="org-left">B-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">75-70</td>
<td class="org-left">C+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">69-66</td>
<td class="org-left">C</td>
<td class="org-left">C</td>
</tr>


<tr>
<td class="org-right">65-60</td>
<td class="org-left">C-</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">59-56</td>
<td class="org-left">D+</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-right">55-50</td>
<td class="org-left">D</td>
<td class="org-left">D</td>
</tr>
</tbody>

<tbody>
<tr>
<td class="org-right">49-0</td>
<td class="org-left">F</td>
<td class="org-left">F</td>
</tr>
</tbody>
</table>


### DataCamp assignments (15%)

Chapters of several DataCamp courses will be assigned to you. To
complete a chapter takes 20-30 minutes per week. If you complete
these courses, you get data science certificates that you can add
to your resume (or to career management portals like LinkedIn -
see [my LinkedIn profile](https://www.linkedin.com/in/birkenkrahe) for an example), or frame and put them on
your wall. Your DataCamp assignment completion rate will enter the
final grade cumulatively.


### Tests (15%)

There will be 30 short multiple choice tests of 5 questions per
week. Your grade will be computed from your average completion rate
over all tests.


### Project presentation (30%)

In the last week, you present the results of an agile explorative
data analysis (EDA) team project. We use the agile Scrum
methodology throughout the term, which means that you will present
prototype results during four sprint reviews (about once every four
weeks), the last of which is the final product or project
presentation.

Note that only the final presentation will be graded according to
the grading table. Detailed grading criteria for the presentation
will be given in class in the form of a rubric.


### Exam (40%)

The final exam will consist of a subset of the weekly test
questions, possibly with some slight variations to make it more
interesting. The basic idea is that you can use the tests to
prepare yourself for the exam. The completion rate of the final
exam will enter the final grade according to the grading table.


## Grading examples


### Example - Midterm grade

At midterms, student X has achieved the following results:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Grade part**</th>
<th scope="col" class="org-right">**Weight**</th>
<th scope="col" class="org-right">**Result**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Tests</td>
<td class="org-right">15%</td>
<td class="org-right">72%</td>
</tr>


<tr>
<td class="org-left">DataCamp assignment</td>
<td class="org-right">15%</td>
<td class="org-right">100%</td>
</tr>
</tbody>
</table>

Student X's midterm result is a "B+" (`86%`).


### Example - Final grade

After the finals, student X has achieved the following results:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Grade part**</th>
<th scope="col" class="org-right">**Weight**</th>
<th scope="col" class="org-right">**Result**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">Tests</td>
<td class="org-right">15%</td>
<td class="org-right">72%</td>
</tr>


<tr>
<td class="org-left">DataCamp assignment</td>
<td class="org-right">15%</td>
<td class="org-right">100%</td>
</tr>


<tr>
<td class="org-left">Project presentation</td>
<td class="org-right">30%</td>
<td class="org-right">95%</td>
</tr>


<tr>
<td class="org-left">Final exam</td>
<td class="org-right">40%</td>
<td class="org-right">90%</td>
</tr>
</tbody>
</table>

Student X's midterm result is an "A" (`90.3%`).


# Standard Policies
