syllabus.md


## Honor Code

All graded work in this class is to be pledged in accordance with
the Lyon College Honor Code. The use of a phone for any reason
during the course of an exam is considered an honor code
violation.


## Class Attendance Policy

Students are expected to attend all class periods for the courses
in which they are enrolled. They are responsible for conferring
with individual professors regarding any missed
assignments. Faculty members are to notify the Registrar when a
student misses the equivalent of one, two, three, and four weeks
of class periods in a single course. Under this policy, there is
no distinction between “excused” and “unexcused” absences, except
that a student may make up work missed during an excused
absence. A reminder of the college’s attendance policy will be
issued to the student at one week, a second reminder at two weeks,
a warning at three weeks, and notification of administrative
withdrawal and the assigning of an “F” grade at four
weeks. Students who are administratively withdrawn from more than
one course will be placed on probation or suspended.


## Disabilities

Students seeking reasonable accommodations based on documented
learning disabilities must contact Danell Hetrick in the Morrow
Academic Center at (870) 307-7021 or at danell.hetrick@lyon.edu.


## Harassment, Discrimination, and Sexual Misconduct

Title IX and Lyon’s policy prohibit harassment, discrimination and
sexual misconduct. Lyon encourages anyone experiencing harassment,
discrimination or sexual misconduct to talk to Lai-Monte Hunter,
Title IX Coordinator and Vice-President for Student Life, or
Sh’Nita Mitchell, Title IX Investigator and Associate Dean for
Residence Life, about what happened so they can get the support
they need and Lyon can respond appropriately.  Lyon is legally
obligated to respond to reports of sexual misconduct, and
therefore we cannot guarantee the confidentiality of a report,
unless made to a confidential resource (Chaplain, Counselor, or
Nurse). As a faculty member, I am required to report possible
Title IX violations and must provide our Title IX coordinator with
all relevant details.  I cannot, therefore, guarantee
confidentiality.


## College-Wide COVID-19 Policies for Fall, 2021

Masks are mandated for all students in classrooms, laboratories and studios.  They remain optional for all persons on the Lyon campus in all other locations and outside.
Participation in community surveillance testing in mandatory.
Vaccines are STRONGLY encouraged for all faculty, staff, and students. Vaccines are NOT MANDATED for Lyon College community members.

Details specific to this course may be found in the subsequent pages of this syllabus. Those details will include at least the following:
A description of the course consistent with the Lyon College catalog.
A list of student learning outcomes for the course.
A summary of all course requirements.
An explanation of the grading system to be used in the course.
Any course-specific attendance policies that go beyond the College policy.
Details about what constitutes acceptable and unacceptable student collaboration on graded work.


# Course specific information


## Assignments and Honor Code

There will be numerous assignments during the semester -
programming, lessons, tests, and sprint reviews. They are due at
the beginning of the class period on the due date. Once class
begins, the assigment will be considered one day late if it has
not been turned in.  Late programs will not be accepted without an
extension.  Extensions will not be granted for reasons such as:

-   You could not get to a computer
-   You could not get a computer to do what you wanted it to do
-   The network was down
-   The printer was out of paper or toner
-   You erased your files, lost your homework, or misplaced your
    flash drive
-   You had other coursework or family commitments that interfered
    with your work in this course

Put “Pledged” and a note of any collaboration in the comments of
any program you turn in. Programming assignments are individual
efforts, but you may seek assistance from another student or me.
You may not copy someone else’s solution.  If you are having
trouble finishing an assignment, it is far better to do your own
work and receive a low score than to go through an honor trial and
suffer the penalties that may be involved.

What is cheating on an assignment? Here are a few examples:

-   Having someone else write your program, in whole or in part
-   Copying a program someone else wrote, in whole or in part
-   Collaborating with someone else to the extent that your programs
    are identifiably very similar, in whole or in part
-   Turning in a program with the wrong name on it

What is not cheating?  Here are some examples:

-   Talking to someone in general terms about concepts involved in
    an assignment
-   Asking someone for help with a specific error message or bug in
    your program
-   Getting help with the specifics of language syntax
-   Utilizing information given to you by the instructor

Any assistance must be clearly explained in the comments at the
beginning of your program.  If you have any questions about this,
please ask or review the policies relating to the Honor Code.

Absences on Days of Exams:

Test “make-ups” will only be allowed if arrangements have been
made prior to the scheduled time.  If you are sick the day of the
test, please e-mail me or leave a message on my phone before the
scheduled time, and we can make arrangements when you return.


## Important Dates:

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Date**</th>
<th scope="col" class="org-left">**Description**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">August 30</td>
<td class="org-left">Last day to drop w/o record of a course</td>
</tr>


<tr>
<td class="org-left">September 6</td>
<td class="org-left">Labor day (no classes)</td>
</tr>


<tr>
<td class="org-left">October 2-5</td>
<td class="org-left">Fall break (no classes)</td>
</tr>


<tr>
<td class="org-left">October 6</td>
<td class="org-left">Mid-semester grade reports due</td>
</tr>


<tr>
<td class="org-left">October 13</td>
<td class="org-left">Last day to drop a course with a "W" grade</td>
</tr>


<tr>
<td class="org-left">October 20</td>
<td class="org-left">Service day on campus (no classes)</td>
</tr>


<tr>
<td class="org-left">Nobember 24-28</td>
<td class="org-left">Thanksgiving Break (no classes)</td>
</tr>


<tr>
<td class="org-left">December 3</td>
<td class="org-left">Last day of class</td>
</tr>


<tr>
<td class="org-left">December 6-10</td>
<td class="org-left">Final exams</td>
</tr>


<tr>
<td class="org-left">December 15</td>
<td class="org-left">Final grades due</td>
</tr>
</tbody>
</table>
