syllabus.md


## Schedule and session content

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">**Date**</th>
<th scope="col" class="org-left">**Lectures**</th>
<th scope="col" class="org-left">**Assignments**</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-left">17-Aug</td>
<td class="org-left">**Course overview**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">19-Aug</td>
<td class="org-left">**Data science overview**</td>
<td class="org-left">Intro to Basics</td>
</tr>


<tr>
<td class="org-left">24-Aug</td>
<td class="org-left">**The R shell**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">26-Aug</td>
<td class="org-left">**The R environment**</td>
<td class="org-left">Vectors</td>
</tr>


<tr>
<td class="org-left">31-Aug</td>
<td class="org-left">**Vectors**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">2-Sep</td>
<td class="org-left">**Data frames**</td>
<td class="org-left">Matrices</td>
</tr>


<tr>
<td class="org-left">7-Sep</td>
<td class="org-left">**Factor vectors**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">9-Sep</td>
<td class="org-left">**Lists in R**</td>
<td class="org-left">Factors</td>
</tr>


<tr>
<td class="org-left">14-Sep</td>
<td class="org-left">**`Nile` exploration**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">16-Sep</td>
<td class="org-left">**Visualization**</td>
<td class="org-left">Data frames</td>
</tr>


<tr>
<td class="org-left">21-Sep</td>
<td class="org-left">**Base R graphics**</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">23-Sep</td>
<td class="org-left">**Literate Programming**</td>
<td class="org-left">Lists</td>
</tr>


<tr>
<td class="org-left">28-Sep</td>
<td class="org-left">Iteration I</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">30-Sep</td>
<td class="org-left">Fibonacci series</td>
<td class="org-left">Conditionals</td>
</tr>


<tr>
<td class="org-left">7-Oct</td>
<td class="org-left">Conditions</td>
<td class="org-left">Loops</td>
</tr>


<tr>
<td class="org-left">12-Oct</td>
<td class="org-left">EDA example I</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">14-Oct</td>
<td class="org-left">Linear regression I</td>
<td class="org-left">Functions</td>
</tr>


<tr>
<td class="org-left">19-Oct</td>
<td class="org-left">Object-orientation</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">21-Oct</td>
<td class="org-left">EDA example II</td>
<td class="org-left">The apply family</td>
</tr>


<tr>
<td class="org-left">26-Oct</td>
<td class="org-left">Packages</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">28-Oct</td>
<td class="org-left">Grammar of Graphics</td>
<td class="org-left">Base R graphics</td>
</tr>


<tr>
<td class="org-left">2-Nov</td>
<td class="org-left">Functional Programming</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">4-Nov</td>
<td class="org-left">Text mining I</td>
<td class="org-left">Different plot types</td>
</tr>


<tr>
<td class="org-left">9-Nov</td>
<td class="org-left">Text mining II</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">11-Nov</td>
<td class="org-left">Linear regression II</td>
<td class="org-left">Adding details to plots</td>
</tr>


<tr>
<td class="org-left">16-Nov</td>
<td class="org-left">Dates and times</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">18-Nov</td>
<td class="org-left">Coding style</td>
<td class="org-left">How much is too much</td>
</tr>


<tr>
<td class="org-left">23-Nov</td>
<td class="org-left">Logistic regression</td>
<td class="org-left">&#xa0;</td>
</tr>


<tr>
<td class="org-left">30-Nov</td>
<td class="org-left">Team presentations</td>
<td class="org-left">Plot customization</td>
</tr>


<tr>
<td class="org-left">2-Dec</td>
<td class="org-left">Team presentations</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

